Revit 2027 API
NumberedReferenceInfo Properties
The NumberedReferenceInfo type exposes the following members.
Properties
Name | Description
FormattedNumber |  The formated number associated with this reference.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
NumberingParameterId |  The parameter id associated with this reference that is used for numbering.
NumberingSchemaId |  The numbering schema associated with this reference.
NumberingSchemaName |  The name of the numbering schema associated with this reference.
PartitionName |  The partition associated with this reference.
Value |  The integer representation of number associated with this reference.
Top
See Also
Reference
NumberedReferenceInfo Class
Autodesk.Revit.DB Namespace